Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectSelector.GetAllObjectsWithType Method
 Returns an enumerator of all the model objects in the current model with the given type.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectEnumerator GetAllObjectsWithType(
	AnalysisObject.AnalysisObjectEnum ObjectToSelectType,
	string AnalysisModelName
)
Public Function GetAllObjectsWithType (
	ObjectToSelectType As AnalysisObject.AnalysisObjectEnum,
	AnalysisModelName As String
) As AnalysisObjectEnumerator
Parameters
ObjectToSelectType
Type: Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum
The type of the objects to return.
AnalysisModelName
Type: System.String
The name of the analysis model.
Return Value
Type: AnalysisObjectEnumerator
A model object enumerator of all the model objects with the given type.
See Also
Reference
AnalysisObjectSelector Class
Tekla.Structures.Analysis Namespace